In [2]:
import numpy as np
import pandas as pd

**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [4]:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 
                  'spoonbills'], 
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [24]:
birds=pd.DataFrame(data,index=labels)
birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [204]:
birds.describe(include='all')

         birds       age     visits priority country       False
count       10  8.000000  10.000000       10      10          10
unique       3       NaN        NaN        2       4           1
top     Cranes       NaN        NaN       no     Ind  trumpeters
freq         4       NaN        NaN        6       4          10
mean       NaN  4.437500   2.900000      NaN     NaN         NaN
std        NaN  2.007797   0.875595      NaN     NaN         NaN
min        NaN  1.500000   2.000000      NaN     NaN         NaN
25%        NaN  3.375000   2.000000      NaN     NaN         NaN
50%        NaN  4.000000   3.000000      NaN     NaN         NaN
75%        NaN  5.625000   3.750000      NaN     NaN         NaN
max        NaN  8.000000   4.000000      NaN     NaN         NaN

**3. Print the first 2 rows of the birds dataframe **

In [25]:
birds[:2]

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [26]:
birds[['birds','age']]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [41]:
birds.iloc[[2,3,7],[0,1,2]]

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [54]:
birds[birds['visits']<4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [74]:
i=birds['age'][birds['age'].isna()].index
birds.loc[i,['birds','visits']]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [90]:
birds[(birds['birds']=='Cranes')&(birds['age']<4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [91]:
birds[(birds['age']>2) & (birds['age']<4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**10. Find the total number of visits of the bird Cranes**

In [97]:
a=birds[birds['birds']=='Cranes']
a['visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [107]:
birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

In [127]:
s=a['age'].mean()
b=birds[birds['birds']=='plovers']
t=b['age'].mean()
c=birds[birds['birds']=='spoonbills']
v=birds['age'].mean()
print('Crane :',s,'plovers :',t,'spoonbills:',v)

Crane : 3.5 plovers : 3.5 spoonbills: 4.4375

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [151]:
birds['K']=np.random.choice(['Ind','AUS','SL','US'],10,replace=True)
birds

        birds  age  visits priority country    K
a      Cranes  3.5       2      yes     Ind   SL
b      Cranes  4.0       4      yes     AUS  Ind
c     plovers  1.5       3       no     Ind  Ind
d  spoonbills  NaN       4      yes     AUS   US
e  spoonbills  6.0       3       no     Ind   SL
f      Cranes  3.0       4       no      US  AUS
g     plovers  5.5       2       no      SL   SL
h      Cranes  NaN       2      yes     Ind  Ind
i  spoonbills  8.0       3       no      SL   US
j  spoonbills  4.0       2       no      SL  Ind

In [ ]:
birds.drop(columns=['K'],axis=0,inplace=True)

In [176]:
birds

        birds  age  visits priority country
a      Cranes  3.5       2      yes     Ind
b      Cranes  4.0       4      yes     AUS
c     plovers  1.5       3       no     Ind
d  spoonbills  NaN       4      yes     AUS
e  spoonbills  6.0       3       no     Ind
f      Cranes  3.0       4       no      US
g     plovers  5.5       2       no      SL
h      Cranes  NaN       2      yes     Ind
i  spoonbills  8.0       3       no      SL
j  spoonbills  4.0       2       no      SL

**13. Find the number of each type of birds in dataframe (Counts)**

In [167]:
birds.value_counts('birds')

birds
Cranes        4
spoonbills    4
plovers       2
dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [181]:
birds.sort_values(by=['age'],ascending=False)

        birds  age  visits priority country
i  spoonbills  8.0       3       no      SL
e  spoonbills  6.0       3       no     Ind
g     plovers  5.5       2       no      SL
b      Cranes  4.0       4      yes     AUS
j  spoonbills  4.0       2       no      SL
a      Cranes  3.5       2      yes     Ind
f      Cranes  3.0       4       no      US
c     plovers  1.5       3       no     Ind
d  spoonbills  NaN       4      yes     AUS
h      Cranes  NaN       2      yes     Ind

In [178]:
birds.sort_values(by='visits')

        birds  age  visits priority country
a      Cranes  3.5       2      yes     Ind
g     plovers  5.5       2       no      SL
h      Cranes  NaN       2      yes     Ind
j  spoonbills  4.0       2       no      SL
c     plovers  1.5       3       no     Ind
e  spoonbills  6.0       3       no     Ind
i  spoonbills  8.0       3       no      SL
b      Cranes  4.0       4      yes     AUS
d  spoonbills  NaN       4      yes     AUS
f      Cranes  3.0       4       no      US

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [222]:
birds['priority']=birds['priority'].replace(['yes','no'],[1,0])

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [223]:
birds['birds']=birds['birds'].replace('Cranes','trumpeters')
birds

        birds  age  visits  priority country       False
a  trumpeters  3.5       2         1     Ind  trumpeters
b  trumpeters  4.0       4         1     AUS  trumpeters
c     plovers  1.5       3         0     Ind  trumpeters
d  spoonbills  NaN       4         1     AUS  trumpeters
e  spoonbills  6.0       3         0     Ind  trumpeters
f  trumpeters  3.0       4         0      US  trumpeters
g     plovers  5.5       2         0      SL  trumpeters
h  trumpeters  NaN       2         1     Ind  trumpeters
i  spoonbills  8.0       3         0      SL  trumpeters
j  spoonbills  4.0       2         0      SL  trumpeters

In [224]:
birds.drop(['False'],axis=1,inplace=True)

KeyError: "['False'] not found in axis"